{
  "personalInfo": {
    "name": "Shanvi Soni",
    "title": "Full-Stack Developer",
    "tagline": "Passionate B.Tech Computer Science student crafting beautiful, user-focused web applications with modern technologies",
    "location": "Bhopal, MP, India",
    "phone": "+91-7388994402",
    "email": "shanvisoni7388@gmail.com",
    "linkedin": "https://www.linkedin.com/in/shanvi-soni-b80474258/",
    "github": "https://github.com/shanvisoni",
    "portfolio": "#",
    "leetcode": "https://leetcode.com/u/shanvi_soni21/"
  },
  "education": {
    "university": "SAGE University, Bhopal",
    "degree": "B.Tech in Computer Science and Engineering",
    "cgpa": "8.38",
    "expectedGraduation": "June 2026",
    "location": "Bhopal, MP, India"
  },
  "currentRoles": [
    {
      "position": "Full Stack Developer",
      "company": "iWin Infotech",
      "type": "Internship | Remote",
      "startDate": "Dec 2025",
      "endDate": "Present",
      "responsibilities": [
        "Working on live gaming platforms for USA users, enhancing React-based applications and delivering updates",
        "Improved and extended frontend components, while maintaining performance and code quality in a shared codebase"
      ]
    },
    {
      "position": "Software Developer",
      "company": "The KnN Migration",
      "type": "Internship | Remote",
      "startDate": "Dec 2025",
      "endDate": "Present",
      "responsibilities": [
        "Developing an Expression of Interest (EOI) management SaaS platform for Australian migration agents",
        "Building secure client portals with multi-step wizards, document uploads, and real-time status tracking",
        "Implementing role-based dashboards, OCR-assisted validation, and SkillSelect API integrations",
        "Working with modern technologies including Java, Spring Boot, PostgreSQL, Docker, and React.js to build scalable and maintainable solutions"
      ]
    }
  ],
  "previousRoles": [
    {
      "position": "Full Stack Developer",
      "company": "EndorseSphere Ventures Private Limited",
      "type": "Internship | Remote",
      "startDate": "Aug 2025",
      "endDate": "Nov 2025",
      "responsibilities": [
        "Developed a recruitment ecosystem that helps companies fill positions 40% faster while increasing the rate of retention candidates by 20%",
        "Worked with technologies like React.js, Redux, PostgreSQL, Prisma, Node.js, Express",
        "Built full-stack features including user authentication, job posting, referral management systems",
        "Collaborated with the development team to implement new features and maintain code quality standards"
      ]
    },
    {
      "position": "MERN Stack Developer",
      "company": "Reactify Labs",
      "type": "Internship | Remote",
      "startDate": "May 2025",
      "endDate": "Aug 2025",
      "responsibilities": [
        "Contributed to client projects, Built features used by 2000+ users",
        "Built frontend components with React.js and secure APIs with NestJS & Express, delivering end-to-end",
        "Collaborated via Git workflows and peer reviews to ensure clean, maintainable, and production-ready code"
      ]
    }
  ],
  "summary": [
    "I'm a motivated B.Tech Computer Science student at SAGE University, Bhopal, with a strong passion for full-stack development. Currently maintaining a CGPA of 8.38, I combine academic excellence with hands-on industry experience.",
    "As a Full Stack Developer at iWin Infotech and Software Developer at The KnN Migration, I'm working on live gaming platforms and EOI management SaaS, building secure portals and features with React, Java, Spring Boot, and modern tooling.",
    "With experience at EndorseSphere Ventures and Reactify Labs, I bring both technical expertise and collaborative skills to every project I work on."
  ]
}